In [1]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('tested.csv',usecols=['Age','Pclass','SibSp','Parch','Survived'])

In [5]:
df.sample()

     Survived  Pclass   Age  SibSp  Parch
109         0       2  18.5      0      0

In [6]:
df.dropna(inplace=True)

In [14]:
x = df[['Age','Pclass','SibSp','Parch']]
y= df['Survived']

In [18]:
x.head()

    Age  Pclass  SibSp  Parch  family_size
0  34.5       3      0      0            1
1  47.0       3      1      0            2
2  62.0       2      0      0            1
3  27.0       3      0      0            1
4  22.0       3      1      1            3

In [17]:
x['family_size']=x['SibSp']+x['Parch']+1

In [11]:
def myfunc(num):
    if num==1:
        return 0
    elif num>1 and num<=4:
        return 1
    else:
        return 2

In [19]:
x['family_type']=x['family_size'].apply(myfunc)

In [22]:
x.sample()

      Age  Pclass  SibSp  Parch  family_size  family_type
101  27.0       2      1      0            2            1

In [24]:
x.drop(columns=['SibSp','Parch','family_size'],inplace=True)

In [25]:
x.sample()

      Age  Pclass  family_type
235  20.0       3            0

# feature splitting

In [27]:
df=pd.read_csv('tested.csv')

In [28]:
df.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
66,958,1,3,"Burns, Miss. Mary Delia",female,18.0,0,0,330963,7.8792,NaN,Q

In [29]:
df['Name']

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [30]:
df['title']=df['Name'].str.split(',',expand=True)[1].str.split('.',expand=True)[0]

In [31]:
df['title']

0           Mr
1          Mrs
2           Mr
3           Mr
4          Mrs
        ...
413         Mr
414       Dona
415         Mr
416         Mr
417     Master
Name: title, Length: 418, dtype: object

In [33]:
df[['title','Name']]

       title                                          Name
0         Mr                              Kelly, Mr. James
1        Mrs              Wilkes, Mrs. James (Ellen Needs)
2         Mr                     Myles, Mr. Thomas Francis
3         Mr                              Wirz, Mr. Albert
4        Mrs  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..       ...                                           ...
413       Mr                            Spector, Mr. Woolf
414     Dona                  Oliva y Ocana, Dona. Fermina
415       Mr                  Saether, Mr. Simon Sivertsen
416       Mr                           Ware, Mr. Frederick
417   Master                      Peter, Master. Michael J

[418 rows x 2 columns]